In [4]:
import seaborn as sns
data = sns.load_dataset('titanic')
data.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [16]:
print("Database dimentions:\n{} columns\n{} rows\n".format(data.shape[1], data.shape[0]))

Database dimentions:
14 columns
891 rows

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [11]:
import pandas as pd
def count_missing_values(data, drop_zeros=True):
    missing_values=pd.DataFrame(data=data.isnull().sum(), columns=["Number of missing values"])
    missing_values["Percent"]=round(100*missing_values["Number of missing values"]/data.shape[0],2)
    missing_values.sort_values(by=["Number of missing values"], ascending=False, inplace=True)
    if drop_zeros:
      missing_values=missing_values[missing_values["Percent"]>0]
    return missing_values

count_missing_values(data)

             Number of missing values  Percent
deck                              688    77.22
age                               177    19.87
embarked                            2     0.22
embark_town                         2     0.22

In [17]:
columns_to_drop=['deck']
for column in columns_to_drop:
    #Column is checked to be in the dataset to avoid errors
    if column in data.columns:
      data.drop(columns=[column], inplace=True)

In [19]:
#Applying a function to a column doesn´t always requires neither apply nor lambda
initial_letter=titanic['embark_town'].fillna(" ").apply(lambda x: x[0])

In [21]:
#Comparisons can be done between different columns row-wise
initial_letter_coincidences=(initial_letter==titanic['embarked'].fillna(" ")).count()

In [23]:
print("Coincidencss between -embark_town- inital letter and -embarked- columns: ", initial_letter_coincidences)
print("Total number of rows: ", titanic.shape[0])

Coincidencss between -embark_town- inital letter and -embarked- columns:  891
Total number of rows:  891